package com.example.zjq.news.bean;

import java.util.List;

public class HistoryBean {


    /**
     * code : 1
     * msg : 数据返回成功！
     * data : [{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{"picUrl":"http://www.todayonhistory.com/upic/201004/21/80231355539.jpg","title":"苏联作曲家普罗科菲耶夫诞辰","year":"1891","month":4,"day":23,"details":"普罗科菲耶夫，1891年4月23日生。父亲是农艺师，母亲是钢琴家，也是他的启蒙老师。5岁开始作曲，由母亲记谱，后来还试写歌剧。1904年入圣彼得堡音乐学院，师从科萨科夫等。1914年演奏自己的作品获鲁宾斯坦奖而毕业。后结识芭蕾舞剧团经理人佳吉列夫，与之交往15年，受其影响亦深。他的作品是现实主义与史诗般的风格，并进一步把传统的调性、旋律手法与20世纪音乐相结合，有135部作品。主要有《Ｇ小调第二小提琴协奏曲》（1935）、芭蕾舞剧《罗密欧马朱丽叶》（1935－1936）、交响童话《彼得与狼》（1936）、歌剧《战争与和平》（1941－1952）、芭蕾舞剧《宝石花》（1948－1950）等。1957年因《升Ｃ小调第七交响曲》（1951－1952）而追授最高列宁奖。但他看不见了。他于1953年3月5日逝世。"},{"picUrl":"http://www.todayonhistory.com/upic/201004/21/29231022442.jpg","title":"中国政治家廖仲恺诞辰","year":"1877","month":4,"day":23,"details":"廖仲恺原名恩煦，广东归善（今惠阳）人，1877年4月23日生于美国旧金山。他是一位伟大的爱国主义者、中国国民党左派领袖、我国民主主义革命的先驱。廖仲恺的一生追求进步，为了国家的独立和民族的解放，他不断探索解决中国革命问题的途径和方法。早在1903年，廖仲恺在日本留学时，就结识了孙中山。从此，他矢志不渝地跟随孙中山，献身于中华民族的解放事业。其后，他参加了辛亥革命、二次革命和反袁护国斗争，以及两次\u201c护法\u201d运动。惨痛的失败，给了他深刻的教训。他和孙中山等人从\u201c祸患生于肘腋，干戈起于肺腑\u201d的残酷事实中认识到，要想寻求革命的出路，就必须联合真正革命的力量。当时国民党是一个组织涣散、纪律松懈的团体，缺乏明确的纲领、陷于瘫痪状态。许多党员腐化堕落，斗志消沉。1923年，廖仲恺受孙中山的委托，开始致力于国民党改组和促进国共合作的伟业，以开拓新的斗争道路。1924年1月20日，具有历史意义的中国国民党第一次全国代表大会在广州隆重召开。这是国共合作的一次盛会，出席大会的165名代表中，有李大钊、毛泽东等共产党员23名。在这次大会上，廖仲恺与共产党人密切合作，击溃了国民党右派分子的猖狂进攻，为实现国共合作作出了贡献。当有人诬蔑共产党员以个人身份加入国民党，是一种\u201c阴谋\u201d时，廖仲恺进行了严厉的驳斥，指出：\u201c只要问加入的人，是否诚意来革命的，此外，即不必多问。此次彼等之加入，是本党一个新生命\u201d。在整个大会过程中，廖仲恺排除各种干扰，极力促成了孙中山的三大政策的贯彻。最后，大会通过了以\u201c联俄、联共、扶助农工\u201d三大政策为基础，以反对帝国主义和封建军阀、实现广泛的民主为中心内容的《中国国民党第一次全国代表大会宣言》。从此，国民党被改组成为工人、农民、小资产阶级和民族资产阶级的革命联盟。这次大会的胜利召开标志着第一次国共合作的建立和中国革命统一战线的形成。孙中山逝世后，廖仲恺忠实地执行孙先生的遗嘱，坚持贯彻三大革命政策，挫败帝国主义和反动派的阴谋，继续同中国共产党亲密合作，在国民党内起到了中流砥柱的作用。1925年8月，正当大革命进入高潮的时候，国民党右派悍然下了毒手，廖仲恺先生惨遭杀害，为革命流尽了最后一滴血。"},{"picUrl":"http://www.todayonhistory.com/upic/200905/17/78153052624.jpg","title":"德国物理学家普朗克诞生","year":"1858","month":4,"day":23,"details":"普朗克，1858年4月23日生。德国物理学家。从师于名家亥姆霍兹和基尔霍夫，年仅21岁即获物理学博士学位，次年任慕尼黑大学讲师，1885年任基尔大学特命教授。他在1900年黑体辐射和吸收的理论研究中，首先提出适用于电磁波谱所有波段的经验公式，即著名的普朗克辐射公式。把当时只能分别在短波波段和长波波段与实验相符的维恩能量分布公式和瑞利辐射公式巧妙而成功地统一起来。1913年丹麦物理学家玻尔用量子理论第一次成功地计算出光谱的特殊谱线的位置，普朗克的理论开始被人们看作是一项惊人的成就。他在1912年任普鲁士科学院教学和自然科学部的终身秘书，自1894年以来一直是该学院的院士；他也是英国皇家学会的外籍会员。从1930年起任柏林威廉研究所的所长；第二次世界大战后，该所以他的名字命名为马克斯-普朗克研究所。1947年10月4日逝世。"},{"picUrl":"http://www.todayonhistory.com/uploadfile/2017/0303/20170303015812248.jpg","title":"俄国占领库页岛","year":"1853","month":4,"day":23,"details":"　　1853年4月23日，俄国占领库页岛。沙皇尼古拉一世命令俄美公司立即占领库页岛，并命令涅维尔斯科伊在库页岛东西两岸各建立一个哨所。　　同年8月，涅维尔斯科伊在库页岛东岸登陆，建立了以沙俄东西伯利亚总督穆拉维约夫命名的哨所。并且公然宣布\u201c库页岛属俄国所有\u201d。沙俄在库页岛北端升起俄国国旗，宣布占有该地，并派兵袭击久春古丹。沙俄派使节普查钦赴日，商讨库页岛的归属问题，结果没有成功。　　库页岛（俄文：Сахалин；日文：桦太岛/からふと ；英文：Sakhalin），自古以来都是中国领土。旧称苦叶、苦兀、骨嵬或黑龙屿。俄译名\u201c萨哈林岛\u201d，日本称为\u201c北虾夷地\u201d（指北海道以北）或\u201c桦太\u201d。该岛位于外东北（外满洲）地区，现为俄罗斯联邦最大岛屿，属萨哈林州管辖。　　库页岛曾是中国最大的岛屿，位于黑龙江出海口之东，东面和北面临鄂霍次克海，西面隔鞑靼海峡与大陆相望，南隔宗谷海峡与日本国接壤。地形南北狭长，面积约76400平方公里，其形状如鱼，拥有超过6000条河流及1600个湖泊，自然资源丰富，物产丰裕。　　库页岛在历史上曾先后为唐朝、辽朝、金朝、元朝、明朝、清朝等朝代直接或间接统治。1689年（清康熙二十八年）9月7日，中俄两国签订《尼布楚条约》，从法律上确立黑龙江和乌苏里江流域包括库页岛在内的广大地区属于中国领土。　　1858年和1860年，俄国通过《瑷珲条约》、《中俄北京条约》一系列不平等条约迫使中国割让库页岛。1873年（清同治十二年），库页岛上的原住民首领最后一次组织部落人民贡貂，向中国皇帝称臣纳贡，此后为俄国所阻，臣属关系断绝。1905年，日本又通过《朴茨茅斯条约》获得库页岛北纬50°以南区域，即南桦太。1905年和1918年至1925年间，库页岛全境被日本统治。　　1945年，苏联发动八月风暴行动，占领库页岛全境。日本在《旧金山和约》放弃南桦太（北纬50°以南）主权，但并未移交，所以日本地图中该岛南部仍为空白区域。目前库页岛全部由俄罗斯控制。"},{},{},{},{},{},{},{},{},{},{}]
     */

    private int code;
    private String msg;
    private List<DataBean> data;

    public int getCode() {
        return code;
    }

    public void setCode(int code) {
        this.code = code;
    }

    public String getMsg() {
        return msg;
    }

    public void setMsg(String msg) {
        this.msg = msg;
    }

    public List<DataBean> getData() {
        return data;
    }

    public void setData(List<DataBean> data) {
        this.data = data;
    }

    public static class DataBean {
        /**
         * picUrl : http://www.todayonhistory.com/upic/201004/21/80231355539.jpg
         * title : 苏联作曲家普罗科菲耶夫诞辰
         * year : 1891
         * month : 4
         * day : 23
         * details : 普罗科菲耶夫，1891年4月23日生。父亲是农艺师，母亲是钢琴家，也是他的启蒙老师。5岁开始作曲，由母亲记谱，后来还试写歌剧。1904年入圣彼得堡音乐学院，师从科萨科夫等。1914年演奏自己的作品获鲁宾斯坦奖而毕业。后结识芭蕾舞剧团经理人佳吉列夫，与之交往15年，受其影响亦深。他的作品是现实主义与史诗般的风格，并进一步把传统的调性、旋律手法与20世纪音乐相结合，有135部作品。主要有《Ｇ小调第二小提琴协奏曲》（1935）、芭蕾舞剧《罗密欧马朱丽叶》（1935－1936）、交响童话《彼得与狼》（1936）、歌剧《战争与和平》（1941－1952）、芭蕾舞剧《宝石花》（1948－1950）等。1957年因《升Ｃ小调第七交响曲》（1951－1952）而追授最高列宁奖。但他看不见了。他于1953年3月5日逝世。
         */

        private String picUrl;
        private String title;
        private String year;
        private int month;
        private int day;
        private String details;

        public String getPicUrl() {
            return picUrl;
        }

        public void setPicUrl(String picUrl) {
            this.picUrl = picUrl;
        }

        public String getTitle() {
            return title;
        }

        public void setTitle(String title) {
            this.title = title;
        }

        public String getYear() {
            return year;
        }

        public void setYear(String year) {
            this.year = year;
        }

        public int getMonth() {
            return month;
        }

        public void setMonth(int month) {
            this.month = month;
        }

        public int getDay() {
            return day;
        }

        public void setDay(int day) {
            this.day = day;
        }

        public String getDetails() {
            return details;
        }

        public void setDetails(String details) {
            this.details = details;
        }
    }
}
